app/controllers/v1/contacts_controller.rb

SELECT  "contacts".* FROM "contacts" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) AS "size", MAX(subquery_for_cache_key.updated_at) AS timestamp FROM (SELECT  "contacts"."updated_at" FROM "contacts" LIMIT ? OFFSET ?) subquery_for_cache_key  [["LIMIT", 5], ["OFFSET", 0]]
---
    def index
      @contacts = Contact.all.page(params.dig(:page, :number) ? params[:page][:number] : 1).per(params[:page].try(:[], :size))