app/controllers/kinds_controller.rb

SELECT "kinds".* FROM "kinds"
---
  def index
    @kinds = Kind.all